app/views/microposts/_micropost.html.erb

  <span class="timestamp">
    Posted <%= time_ago_in_words(micropost.created_at) %> ago.
     <% if current_user?(micropost.user) %>
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Harum fugiat quas velit aut omnis vel quaerat sit."], ["user_id", 5], ["created_at", 2017-01-22 10:04:59 UTC], ["updated_at", 2017-01-22 10:04:59 UTC]]