app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$bWDdcocPlDqUHymW5k7A5.Ze34zMoqH2KhK/OJBgyiSt59eOlKo/C"], ["updated_at", 2017-01-15 22:25:16 UTC], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)